---
kind: method
id: M:Autodesk.Revit.DB.Structure.FabricSheetType.IsCustom
source: html/27448574-3a94-df24-58d9-f12202caa8c6.htm
---
# Autodesk.Revit.DB.Structure.FabricSheetType.IsCustom Method

Verifies if the type is Custom Fabric Sheet

## Syntax (C#)
```csharp
public bool IsCustom()
```

## Returns
True if Layout is set on Custom and if the wireArr is not null